# 第1章 pandasの基礎知識

In [1]:
import pandas as pd
import numpy as np

## 1.1 データの参照と更新（`loc` / `iloc`）

df.loc[行の指定, 列の指定]
sr.loc[行の指定]
df.iloc[行の指定, 列の指定]
sr.iloc[行の指定]

df.loc[行の指定, 列の指定] = 新しい値
sr.loc[行の指定] = 新しい値
df.iloc[行の指定, 列の指定] = 新しい値
sr.iloc[行の指定] = 新しい値

In [2]:
df = pd.DataFrame(
    [["Alice", 87], ["Bob", 65], ["Carol", 92]],
    columns=["Name", "Point"],
    index=[10, 20, 30],
)
display(df)
df["test"] = 0
display(df)

     Name  Point
10  Alice     87
20    Bob     65
30  Carol     92

     Name  Point  test
10  Alice     87     0
20    Bob     65     0
30  Carol     92     0

In [3]:
sr = df.Name  # df["Name"]とも書けます
display(sr)

10    Alice
20      Bob
30    Carol
Name: Name, dtype: object

In [12]:
display(df.loc[20])

Name     Bob
Point     65
test       0
Name: 20, dtype: object

In [13]:
sr.loc[10]

'Alice'

In [14]:
df.loc[:, "Name"]

10    Alice
20      Bob
30    Carol
Name: Name, dtype: object

In [15]:
df.loc[:, "Name"]
df["Name"]

10    Alice
20      Bob
30    Carol
Name: Name, dtype: object

In [16]:
# 警告のでる例

df2 = df.copy()
df2["Name"][20] = "Bill"

C:\Users\cax68\AppData\Local\Temp/ipykernel_9436/2888365818.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["Name"][20] = "Bill"

In [18]:
df2.loc[20, "Name"] = "Bill"
display(df2)

     Name  Point  test
10  Alice     87     0
20   Bill     65     0
30  Carol     92     0

In [19]:
df.loc[10:20]

     Name  Point  test
10  Alice     87     0
20    Bob     65     0

In [20]:
sr.loc[10:20]

10    Alice
20      Bob
Name: Name, dtype: object

In [21]:
columns = ["Jan", "Feb", "Mar", "Apr"]
df4 = pd.DataFrame([[1, 2, 3, 4]], columns=columns)
df4.loc[:, "Feb":"Apr"]

   Feb  Mar  Apr
0    2    3    4

In [22]:
df3 = df.copy()
df3.index = df3.index.astype(str)
df3["10":"20"]

     Name  Point  test
10  Alice     87     0
20    Bob     65     0

In [4]:
sr2 = sr.copy()
sr2.index = sr2.index.astype(str)  # 行名を文字列型に変換
sr2["10":"20"]

10    Alice
20      Bob
Name: Name, dtype: object

In [8]:
sr3 = sr.copy()
sr3.index = ["20", "10", "30"]  # ソートされていないインデックス
sr3["10":"30"]

10      Bob
30    Carol
Name: Name, dtype: object

In [7]:
sr2["10":"3"]

10    Alice
20      Bob
Name: Name, dtype: object

In [16]:
df.loc[10:30, "Name":"test"]

     Name  Point  test
10  Alice     87     0
20    Bob     65     0
30  Carol     92     0

In [18]:
sr.loc[[10, 30,20]]

10    Alice
30    Carol
20      Bob
Name: Name, dtype: object

In [21]:
df.loc[:, ["Name","test"]]

     Name  test
10  Alice     0
20    Bob     0
30  Carol     0

In [22]:
display(df.loc[:, ["Name"]])
display(df[["Name"]])

     Name
10  Alice
20    Bob
30  Carol

     Name
10  Alice
20    Bob
30  Carol

In [23]:
df.loc[df["Point"] >= 80]

     Name  Point  test
10  Alice     87     0
30  Carol     92     0

In [24]:
sr.loc[sr.str.startswith("A")]

10    Alice
Name: Name, dtype: object

In [25]:
df.loc[df["Point"] >= 80]
df[df["Point"] >= 80]

     Name  Point  test
10  Alice     87     0
30  Carol     92     0

In [32]:
# 警告のでる例

df5 = df.copy()
display(df5)
df5.loc[df5["Point"] >= 80,"Point"] = 80
df5

     Name  Point  test
10  Alice     87     0
20    Bob     65     0
30  Carol     92     0

     Name  Point  test
10  Alice     80     0
20    Bob     65     0
30  Carol     80     0

In [33]:
df5.loc[df5["Point"] >= 80, "Point"] = 80
df5

     Name  Point  test
10  Alice     80     0
20    Bob     65     0
30  Carol     80     0

In [34]:
df.loc[:, df.columns.str.startswith("Na")]

     Name
10  Alice
20    Bob
30  Carol

In [35]:
df.iloc[0]

Name     Alice
Point       87
test         0
Name: 10, dtype: object

In [38]:
df.iloc[:, :]

     Name  Point  test
10  Alice     87     0
20    Bob     65     0
30  Carol     92     0

In [37]:
df.iloc[:2]

     Name  Point  test
10  Alice     87     0
20    Bob     65     0

In [39]:
df[:2]

     Name  Point  test
10  Alice     87     0
20    Bob     65     0

In [40]:
df.iloc[[0, 1]]

     Name  Point  test
10  Alice     87     0
20    Bob     65     0

In [48]:
df.iloc[:, :]

     Name  Point  test
10  Alice     87     0
20    Bob     65     0
30  Carol     92     0

## 1.2 行の絞り込み（ブールインデックス）

df[比較結果]  # 比較結果がTrueの行を抜き出したもの
sr[比較結果]  # 同上

In [49]:
df = pd.DataFrame(
    [["Alice", 87, 76], ["Bob", 65, 88]],
    columns=["Name", "Math", "Sci"],
)
df

    Name  Math  Sci
0  Alice    87   76
1    Bob    65   88

In [50]:
df["Math"] >= 80

0     True
1    False
Name: Math, dtype: bool

In [51]:
df[df["Math"] >= 80]

    Name  Math  Sci
0  Alice    87   76

In [52]:
df["Math"] < df["Sci"]

0    False
1     True
dtype: bool

In [53]:
df[df["Math"] < df["Sci"]]

  Name  Math  Sci
1  Bob    65   88

In [54]:
df["Math"].lt(df["Sci"])

0    False
1     True
dtype: bool

In [55]:
df[df["Math"].lt(df["Sci"])]

  Name  Math  Sci
1  Bob    65   88

## 1.3 インデックスの設定（`DataFrame.set_index()`）

df.set_index(列名または列名のリスト)

In [63]:
df = pd.DataFrame(
    [
        ["平日", "大人", 2000],
        ["平日", "小人", 1000],
        ["土日祝", "大人", 3000],
        ["土日祝", "小人", 1500],
    ],
    columns=["日別", "年齢別", "料金"],
)
df

    日別 年齢別    料金
0   平日  大人  2000
1   平日  小人  1000
2  土日祝  大人  3000
3  土日祝  小人  1500

In [57]:
df.set_index("日別")

    年齢別    料金
日別
平日   大人  2000
平日   小人  1000
土日祝  大人  3000
土日祝  小人  1500

In [62]:
df.set_index(["日別", "年齢別"])

           料金
日別  年齢別
平日  大人   2000
    小人   1000
土日祝 大人   3000
    小人   1500

## 1.4 インデックスのリセット（`DataFrame.reset_index()`）

df.reset_index(drop=True)
display(df)

In [69]:
df = pd.DataFrame([[2,0], [np.nan,1], [1,2]], columns=["Point","test"])
df = df.dropna()  # 欠損値を除外してインデックスを不連続にする
df

   Point  test
0    2.0     0
2    1.0     2

In [70]:
df.dropna().reset_index(drop=True)

   Point  test
0    2.0     0
1    1.0     2

df.reset_index()

In [71]:
df = pd.DataFrame(
    [
        ["Alice", "国語", 100],
        ["Alice", "数学", 80],
        ["Bob", "国語", 40],
        ["Bob", "理科", 80],
    ],
    columns=["Name", "Subject", "Point"],
)
df

    Name Subject  Point
0  Alice      国語    100
1  Alice      数学     80
2    Bob      国語     40
3    Bob      理科     80

In [72]:
df.groupby("Name").mean(numeric_only=True)

       Point
Name
Alice   90.0
Bob     60.0

In [73]:
df.groupby("Name").mean(numeric_only=True).reset_index()

    Name  Point
0  Alice   90.0
1    Bob   60.0

## 1.5 Seriesのインデックスのリセット（`Series.reset_index()`）

sr.reset_index(drop=True)  # インデックスを通し番号に変換。結果はSeries
sr.reset_index()  # 列をインデックスに変換。結果はDataFrame

In [74]:
df = pd.DataFrame(
    [
        ["Alice", "国語", 100],
        ["Alice", "数学", 80],
        ["Bob", "国語", 40],
        ["Bob", "理科", 80],
    ],
    columns=["Name", "Subject", "Point"],
)
# 生徒ごとの点数の平均を計算
sr = df.groupby("Name").Point.mean()
sr

Name
Alice    90.0
Bob      60.0
Name: Point, dtype: float64

In [75]:
sr.reset_index(drop=True)

0    90.0
1    60.0
Name: Point, dtype: float64

In [76]:
sr.reset_index()

    Name  Point
0  Alice   90.0
1    Bob   60.0

## 1.6 データの結合（`DataFrame.merge()`）

df1.merge(df2, how=結合方法, on=キー)

df1.merge(df2, how="inner", on=None)

In [85]:
df1 = pd.DataFrame(
    [[0, "Alice"], [0, "Bob"], [1, "Carol"]],
    columns=["ID", "Name"],
)
df2 = pd.DataFrame(
    [[0, "国語"], [0, "数学"]],
    columns=["ID", "Subject"],
)
display(df1)
display(df2)
display(df1.merge(df2, how="inner", on=None))

   ID   Name
0   0  Alice
1   0    Bob
2   1  Carol

   ID Subject
0   0      国語
1   0      数学

   ID   Name Subject
0   0  Alice      国語
1   0  Alice      数学
2   0    Bob      国語
3   0    Bob      数学

In [83]:
df1.merge(df2, how="left")

   ID   Name Subject
0   0  Alice      国語
1   0  Alice      数学
2   0    Bob      国語
3   0    Bob      数学
4   1  Carol     NaN

In [86]:
df1.merge(df2, how="right")

   ID   Name Subject
0   0  Alice      国語
1   0    Bob      国語
2   0  Alice      数学
3   0    Bob      数学

## 1.7 データの結合（`DataFrame.join()`）

df1.join(df2, on=キー, how=結合方法)

df1.join(df2, on=None, how="left")

In [87]:
df1 = pd.DataFrame(
    ["Alice", "Bob", "Carol"],
    index=[0, 0, 1],
    columns=["Name"],
)
df2 = pd.DataFrame(
    ["国語", "数学"], index=[0, 0], columns=["Subject"]
)
df1.join(df2, on=None, how="left")

    Name Subject
0  Alice      国語
0  Alice      数学
0    Bob      国語
0    Bob      数学
1  Carol     NaN

In [88]:
df3 = pd.DataFrame(
    [[0, "Alice"], [0, "Bob"], [1, "Carol"]],
    columns=["ID", "Name"],
)
df3.join(df2, on="ID", how="left")

   ID   Name Subject
0   0  Alice      国語
0   0  Alice      数学
1   0    Bob      国語
1   0    Bob      数学
2   1  Carol     NaN

In [96]:
df3.join(df2, on="ID", how="left")

   ID   Name Subject
0   0  Alice      国語
0   0  Alice      数学
1   0    Bob      国語
1   0    Bob      数学
2   1  Carol     NaN

## 1.8 関数の適用（`DataFrame.apply()` / `Series.apply()`）

In [97]:
# 利用者の年齢と割引種別を格納したデータ
df = pd.DataFrame(
    [[12, ""], [20, "学割利用"], [32, ""]], columns=["年齢", "割引種別"]
)
df

   年齢  割引種別
0  12
1  20  学割利用
2  32

In [98]:
def categorize(x):
    # 引数xには、各要素の値が渡される
    return "子供" if x < 13 else "大人"

# 列「年齢」の各要素にcategorize()を適用する
df["年齢"].apply(categorize)

0    子供
1    大人
2    大人
Name: 年齢, dtype: object

In [99]:
def categorize(sr):
    # 引数srには、各行のSeriesが渡される
    age_type = "子供" if sr["年齢"] < 13 else "大人"
    coupon_type = f"（{sr['割引種別']}）" if sr["割引種別"] else ""
    return age_type + coupon_type  # 年齢と割引種別を連結

# 各行にcategorize()を適用する（列に沿った処理）
df.apply(categorize, axis=1)

0          子供
1    大人（学割利用）
2          大人
dtype: object

## 1.9 データのグループ化（`DataFrame.groupby()`）

# 指定した列でグループ化（結果はDataFrameGroupByオブジェクト）
grouped = df.groupby(列名または列名のリスト)
# 集約メソッドと組み合わせて、グループごとにデータを集約
grouped.集約メソッド()

In [100]:
# 生徒ごとの身長と体重を記録したデータ
df = pd.DataFrame(
    [["A", 172, 63], ["A", 160, 54], ["B", 155, 51], ["B", 162, 59]],
    columns=["クラス", "身長", "体重"],
)
df

  クラス   身長  体重
0   A  172  63
1   A  160  54
2   B  155  51
3   B  162  59

In [101]:
# 各クラスの平均値
df.groupby("クラス").mean()

        身長    体重
クラス
A    166.0  58.5
B    158.5  55.0

In [102]:
# 各クラスの身長の平均値
df.groupby("クラス")["身長"].mean()

クラス
A    166.0
B    158.5
Name: 身長, dtype: float64